In [1]:
import pandas as pd
## NOTE : openpyxl 가 필요함

ModuleNotFoundError: No module named 'pandas'

## 명단

In [78]:
df_list = pd.read_excel("list.xlsx")
display(df_list.head())
display(df_list.tail())

,출 석 부,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 45,Unnamed: 46,Unnamed: 47,Unnamed: 48,Unnamed: 49,Unnamed: 50,Unnamed: 51,Unnamed: 52,Unnamed: 53,Unnamed: 54
0,2022 년도 제 1 학기,NaN,NaN,학점,NaN,NaN,NaN,3,NaN,NaN,...,서강대학교(서울),NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,과목코드 - 분반,NaN,NaN,11111,NaN,NaN,NaN,교과목명,NaN,NaN,...,표기예시,NaN,NaN,"(● :출석, ▲ : 지각, X : 결석, - : 미체크)",NaN,NaN,NaN,NaN,NaN,NaN
2,순번,학과,NaN,학번,학년,성명,주,2,4,NaN,...,\n,\n,\n,\n,\n,\n,출석\n일수,지각\n일수,결석\n일수,미체크
3,NaN,NaN,NaN,NaN,NaN,NaN,차\n시,1,1,2,...,\n,\n,\n,\n,\n,\n,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,월,3,3,3,...,\n,\n,\n,\n,\n,\n,NaN,NaN,NaN,NaN

,출 석 부,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 45,Unnamed: 46,Unnamed: 47,Unnamed: 48,Unnamed: 49,Unnamed: 50,Unnamed: 51,Unnamed: 52,Unnamed: 53,Unnamed: 54
7,NaN,NaN,NaN,NaN,NaN,NaN,구\n분,NaN,NaN,NaN,...,\n,\n,\n,\n,\n,\n,NaN,NaN,NaN,NaN
8,1,경영학부(경영학전공),NaN,1234,2,김김김,NaN,●,●,●,...,\n,\n,\n,\n,\n,\n,5,0,0,0
9,2,경제학과,NaN,5678,4,박박박,NaN,●,●,●,...,\n,\n,\n,\n,\n,\n,5,0,0,0
10,3,모른다학과,NaN,0000,3,Lee Le L,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,4,fasd,NaN,1111,1,나나나,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [79]:
df_list[df_list.columns[3]]

0        학점
1     11111
2        학번
3       NaN
4       NaN
5       NaN
6       NaN
7       NaN
8      1234
9      5678
10     0000
11     1111
Name: Unnamed: 3, dtype: object

In [80]:
df_list[df_list.columns[5]]

0          NaN
1          NaN
2           성명
3          NaN
4          NaN
5          NaN
6          NaN
7          NaN
8          김김김
9          박박박
10    Lee Le L
11         나나나
Name: Unnamed: 5, dtype: object

idx 8 부터 데이터 존재  
항목 변수 생성

In [128]:
df_list.iloc[8,3]
list_student=[]
for i in range(8,len(df_list)) : 
    list_student.append([df_list.iloc[i,3],df_list.iloc[i,5],"결석"]) # default "결석"
print(list_student)

[['1234', '김김김', '결석'], ['5678', '박박박', '결석'], ['0000', 'Lee Le L', '결석'], ['1111', '나나나', '결석']]

## ZOOM 기록

In [129]:
df_log = pd.read_excel("log.xlsx")
display(df_log.head())
display(df_log.tail())

,실시간강의 참가이력,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,No,진행번호,이름(Zoom),이메일(Zoom),수강생,학번,이름,학과,입장시간,퇴장시간,진행시간
1,1,1,강사,강사,N,15789,강강강,전인교육원(교양일반),2022.05.06 오전 10:11:43,r,2시간 58분 42초
2,2,1,1234 김김김,NaN,N,-,NaN,NaN,2022.05.06 오전 10:12:03,2022.05.06 오전 10:21:13,9분 10초
3,16,1,5678 박박박,NaN,N,-,NaN,NaN,2022.05.06 오전 10:21:05,2022.05.06 오후 1:08:37,2시간 47분 32초
4,17,1,Lee Le,NaN,N,-,NaN,NaN,2022.05.06 오전 10:21:06,2022.05.06 오후 1:08:38,2시간 47분 32초

,실시간강의 참가이력,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
1,1,1,강사,강사,N,15789,강강강,전인교육원(교양일반),2022.05.06 오전 10:11:43,r,2시간 58분 42초
2,2,1,1234 김김김,NaN,N,-,NaN,NaN,2022.05.06 오전 10:12:03,2022.05.06 오전 10:21:13,9분 10초
3,16,1,5678 박박박,NaN,N,-,NaN,NaN,2022.05.06 오전 10:21:05,2022.05.06 오후 1:08:37,2시간 47분 32초
4,17,1,Lee Le,NaN,N,-,NaN,NaN,2022.05.06 오전 10:21:06,2022.05.06 오후 1:08:38,2시간 47분 32초
5,18,1,나나나,NaN,N,-,NaN,NaN,2022.05.06 오전 10:21:06,2022.05.06 오후 1:09:37,2시간 48분 31초

시간 item 및 수치로 변환

In [2]:
import datetime

In [131]:
display(df_log.iloc[0:,2])
display(df_log.iloc[0:,8])
display(df_log.iloc[0:,9])
x = datetime.datetime.strptime(df_log.iloc[2,8].split(" ")[-1],'%H:%M:%S')
y = datetime.datetime.strptime(df_log.iloc[2,9].split(" ")[-1],'%H:%M:%S')
display(x)
display(y)
x<y

0    이름(Zoom)
1          강사
2    1234 김김김
3    5678 박박박
4      Lee Le
5         나나나
Name: Unnamed: 2, dtype: object

0                      입장시간
1    2022.05.06 오전 10:11:43
2    2022.05.06 오전 10:12:03
3    2022.05.06 오전 10:21:05
4    2022.05.06 오전 10:21:06
5    2022.05.06 오전 10:21:06
Name: Unnamed: 8, dtype: object

0                      퇴장시간
1                         r
2    2022.05.06 오전 10:21:13
3     2022.05.06 오후 1:08:37
4     2022.05.06 오후 1:08:38
5     2022.05.06 오후 1:09:37
Name: Unnamed: 9, dtype: object

datetime.datetime(1900, 1, 1, 10, 12, 3)

datetime.datetime(1900, 1, 1, 10, 21, 13)

True

출결 체크

In [140]:
t_start = datetime.datetime(1900,1,1,10,31,0)
t_class = datetime.timedelta(minutes=60)
t_end   = t_start + t_class
display(t_start)
display(t_end)

datetime.datetime(1900, 1, 1, 10, 31)

datetime.datetime(1900, 1, 1, 11, 31)

In [143]:
noon = datetime.timedelta(hours=12)
# per each student
for student in list_student : 
    idx = 2
    # for all log
    for i_log in df_log.iloc[idx:,2] : 
        t_in = datetime.datetime.strptime(df_log.iloc[idx,8].split(" ")[-1],'%H:%M:%S')
        t_out = datetime.datetime.strptime(df_log.iloc[idx,9].split(" ")[-1],'%H:%M:%S')
        if df_log.iloc[idx,9].split(" ")[1] == "오후" : 
            t_out += noon
        
        # id, name
        for i_stu in student[0:2] :
            # matching ? 
            if i_stu in i_log : 
                # in class
                if  t_in <= t_start and  t_out >= t_end :
                    student[2] = "출석"
        idx+=1
        
print(list_student)

[['1234', '김김김', '결석'], ['5678', '박박박', '출석'], ['0000', 'Lee Le L', '결석'], ['1111', '나나나', '출석']]

## 출석부

In [148]:
df = pd.DataFrame(list_student, columns = ['학번', '이름', '출결'])
df = df.set_index('학번')
df = df.sort_index()
print(df)
df.to_excel("output.xlsx")

            이름  출결
학번
0000  Lee Le L  결석
1111       나나나  출석
1234       김김김  결석
5678       박박박  출석

## 저장

##  Timedelta to int

In [20]:
t_in   = datetime.datetime(1900,1,1,10,31,0)
t_out  = datetime.datetime(1900,1,1,10,31,5)

In [21]:
diff = t_out - t_in

In [22]:
diff / datetime.timedelta(minutes=1)

0.08333333333333333

In [26]:
t_out.hour

10